#+TITLE: Emacs configuration file
#+AUTHOR: Tony Day
#+EMAIL: zygomega at gmail dot com
#+OPTIONS: toc:2 num:nil ^:nil

*** norang
	 :LOGBOOK:
	 CLOCK: [2012-07-17 Tue 10:01]--[2012-07-17 Tue 10:16] =>  0:15
	 CLOCK: [2012-07-17 Tue 09:55]--[2012-07-17 Tue 10:01] =>  0:06
	 CLOCK: [2012-07-17 Tue 09:09]--[2012-07-17 Tue 09:55] =>  0:46
	 :END:

The http://doc.norang.ca/ site is the best I know for an introduction
to what can be achieved through the use of org-mode, and how to go
about the task. My initial inspiration to start playing around with
and eventually adopting an org style of working came from pouring
through this site. Much of the actual code used to set up org-mode
is a cut and paste from http://doc.norang.ca/org-mode.html.

If you are looking for a more general introduction to org-mode, then
norang is a much better spot to start. This is especially true for the
org time and project management material - Bernt's code is so good I
pretty much dropped his init file in and it all worked out of the box.

I have spent some time using the org productivity tools and all I can
do is quote Douglas Adams.

#+BEGIN_QUOTE
I love deadlines. I like the whooshing sound they make as they fly by.
-- Douglas Adams
#+END_QUOTE

This file is more about documenting the code and environment needed to
reproduce [[scarecapital.com][my]] research.

<<<<<<< HEAD
*** other dot emacs files
	 :LOGBOOK:  
	 CLOCK: [2012-04-12 Thu 23:14]--[2012-04-12 Thu 23:16] =>  0:02
	 CLOCK: [2012-04-12 Thu 22:43]--[2012-04-12 Thu 22:57] =>  0:14
	 :END:      

- [ ] add new ones

There are many, many dot files out there and anyone who has used emacs
before emacs24 has spent time looking for themselves.  Some
recommended reading:

[[info:emacs#Init%20File][info:emacs#Init File]]
http://www.emacswiki.org/emacs/RobertAdesamConfig
http://robert-adesam.blogspot.com.au/2011/01/emacsclient-setup-on-windows-7-starter.html
http://www.emacswiki.org/emacs/EmacsInitFileOfSylecn
http://a-nickels-worth.blogspot.com.au/2007/11/effective-emacs.html

** git folder list

#+begin_src emacs-lisp
      
        (setq magit-repo-dirs '("~/.emacs.d" 
                                "~/stuff"
                                "~/dotemacs-mashup"
                                "~/emfx"))
      
#+end_src

#+results:
| ~/.emacs.d | ~/stuff | ~/dotemacs-mashup | ~/emfx |




